#include <iostream>
using namespace std;

int main()
{
    int n, m, w, k, a, b;     //n+1, m+1 - количество пересечений прямых линий; их * - общее количество пересечений; n*m*(+)*(+) - количество возможных прямоугольников
    cout << "Enter n, m" << endl;     //прямоугольник можно выбрать: (0; 0), (N+1; М+1); (N+1; М+1), (0; 0); (N+1; 0), (0; М+1); (0; М+1), (N+1; 0)
    cin >> n >> m;
    w = 75000;
    if (n <= 0 || m <= 0 || n > w || m > w) {
        cout << "Error" << endl;
    }
    else {
        a = (n * (n + 1)) / 2;
        b = (m * (m + 1)) / 2;
        k = a * b;
        cout << "k = " << k << endl;
    }
}
